<a href="https://colab.research.google.com/github/Anurag5003/AN-EFFICIENT-ARCHITECTURE-FOR-THE-ACCURATE-PREDICTION-OF-CROP-USING-ENSEMBLE-LEARNING/blob/main/Data_Prep.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Transforming Raw Data to Processed Data for Model Training**

In [ ]:
import pandas as pd

In [ ]:
crop = pd.read_csv('cpdata.csv')
fert = pd.read_csv('Fertilizer.csv')

In [ ]:
crop

In [ ]:
crop.head()

   temperature   humidity        ph    rainfall label
0    20.879744  82.002744  6.502985  202.935536  rice
1    21.770462  80.319644  7.038096  226.655537  rice
2    23.004459  82.320763  7.840207  263.964248  rice
3    26.491096  80.158363  6.980401  242.864034  rice
4    20.130175  81.604873  7.628473  262.717340  rice

In [ ]:
fert.head()

   Unnamed: 0             Crop   N   P   K   pH
0           0             rice  80  40  40  5.5
1           1   jowar(sorghum)  80  40  40  5.5
2           2      barley(jav)  70  40  45  5.5
3           3            maize  80  40  20  5.5
4           4  ragi(naachnnii)  50  40  20  5.5

In [ ]:
# Function for lowering the cases
def change_case(i):
    i = i.replace(" ", "")
    i = i.lower()
    return i

fert['Crop'] = fert['Crop'].apply(change_case)
crop['label'] = crop['label'].apply(change_case)

In [ ]:
#make some changes in ferttilizer dataset

fert['Crop'] = fert['Crop'].replace('mungbeans','mungbean')
fert['Crop'] = fert['Crop'].replace('lentils(masoordal)','lentil')
fert['Crop'] = fert['Crop'].replace('pigeonpeas(toordal)','pigeonpeas')
fert['Crop'] = fert['Crop'].replace('mothbean(matki)','mothbeans')
fert['Crop'] = fert['Crop'].replace('chickpeas(channa)','chickpea')

In [ ]:
fert

      Unnamed: 0             Crop    N   P   K    pH
0              0             rice   80  40  40  5.50
1              1   jowar(sorghum)   80  40  40  5.50
2              2      barley(jav)   70  40  45  5.50
3              3            maize   80  40  20  5.50
4              4  ragi(naachnnii)   50  40  20  5.50
...          ...              ...  ...  ..  ..   ...
1838        1838       lemongrass   25  40  40  5.32
1839        1839           cotton  120  40  20  5.32
1840        1840             jute   80  40  40  5.32
1841        1841           coffee  100  20  30  5.32
1842        1842        sunflower   50  60  30  5.32

[1843 rows x 6 columns]

In [ ]:
crop_names = crop['label'].value_counts()
print(len(crop_names))

31

In [ ]:
del fert['Unnamed: 0']

crop_names_from_fert = fert['Crop'].unique()
crop_names_from_fert

array(['rice', 'jowar(sorghum)', 'barley(jav)', 'maize',
       'ragi(naachnnii)', 'chickpea', 'frenchbeans(farasbi)',
       'favabeans(papdi-val)', 'limabeans(pavta)', 'clusterbeans(gavar)',
       'soyabean', 'blackeyedbeans(chawli)', 'kidneybeans', 'pigeonpeas',
       'mothbeans', 'mungbean', 'greenpeas', 'horsegram(kulthi)',
       'blackgram', 'rapeseed(mohri)', 'corianderseeds', 'mustardseeds',
       'sesameseed', 'cuminseeds', 'lentil', 'brinjal', 'beetroot',
       'bittergourd', 'bottlegourd', 'capsicum', 'cabbage', 'carrot',
       'cauliflower', 'cucumber', 'corianderleaves', 'curryleaves',
       'drumstick–moringa', 'chili', 'ladyfinger', 'mushroom', 'onion',
       'potato', 'pumpkin', 'radish', 'olive', 'sweetpotato',
       'fenugreekleaf(methi)', 'spinach', 'ridgegourd',
       'gooseberry(amla)', 'jambun(syzygiumcumini)',
       'ziziphusmauritiana(bor)', 'garciniaindica(kokam)', 'tamarind',
       'tapioca(suran)', 'garlic', 'lemon', 'tomato', 'ashgourd',
       'pineapple', 'pomegranate', 'banana', 'mango', 'grapes',
       'jackfruit', 'guava', 'watermelon', 'muskmelon', 'apricot',
       'apple', 'chickoo', 'custardapple', 'dates', 'figs', 'orange',
       'papaya', 'aniseed', 'asafoetida', 'bayleaf', 'blackpepper',
       'cardamom', 'cinnamon', 'cloves', 'jaiphal(nutmeg)', 'ginger',
       'turmeric', 'cashewnuts', 'raisins', 'coconut', 'almondnut',
       'arecanut', 'pistachionut', 'lemongrass', 'cotton', 'jute',
       'coffee', 'sunflower'], dtype=object)

In [ ]:
crop['label']

0             rice
1             rice
2             rice
3             rice
4             rice
           ...
3095    watermelon
3096    watermelon
3097    watermelon
3098    watermelon
3099    watermelon
Name: label, Length: 3100, dtype: object

In [ ]:
extract_labels = []
for i in crop_names_from_fert:
    if i in crop_names:
        extract_labels.append(i)

In [ ]:
# using extract labels on crop to get all the data related to those labels
new_crop = pd.DataFrame(columns = crop.columns)
new_fert = pd.DataFrame(columns = fert.columns)

In [ ]:
for label in extract_labels:
    new_crop = new_crop.append(crop[crop['label'] == label])

for label in extract_labels:
    new_fert = new_fert.append(fert[fert['Crop'] == label].iloc[0])

new_crop
new_fert

           Crop    N    P    K   pH
0          rice   80   40   40  5.5
3         maize   80   40   20  5.5
60  pomegranate   20   10   40  5.5
61       banana  100   75   50  6.5
62        mango   20   20   30  5.0
63       grapes   20  125  200  4.0
66   watermelon  100   10   50  5.5
67    muskmelon  100   10   50  5.5
69        apple   20  125  200  6.5
74       orange   20   10   10  4.0
75       papaya   50   50   50  6.0

In [ ]:
new_fert

           Crop    N    P    K   pH
0          rice   80   40   40  5.5
3         maize   80   40   20  5.5
60  pomegranate   20   10   40  5.5
61       banana  100   75   50  6.5
62        mango   20   20   30  5.0
63       grapes   20  125  200  4.0
66   watermelon  100   10   50  5.5
67    muskmelon  100   10   50  5.5
69        apple   20  125  200  6.5
74       orange   20   10   10  4.0
75       papaya   50   50   50  6.0

In [ ]:
new_crop

      temperature   humidity        ph    rainfall   label
0       20.879744  82.002744  6.502985  202.935536    rice
1       21.770462  80.319644  7.038096  226.655537    rice
2       23.004459  82.320763  7.840207  263.964248    rice
3       26.491096  80.158363  6.980401  242.864034    rice
4       20.130175  81.604873  7.628473  262.717340    rice
...           ...        ...       ...         ...     ...
2895    40.102077  94.351102  6.979102  149.119999  papaya
2896    38.589545  91.580765  6.825665  102.270823  papaya
2897    41.313301  91.150880  6.617067  239.742755  papaya
2898    37.035519  91.794302  6.551893  188.518142  papaya
2899    23.012402  91.073555  6.598860  208.335798  papaya

[1100 rows x 5 columns]

In [ ]:
new_crop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1100 entries, 0 to 2899
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   temperature  1100 non-null   float64
 1   humidity     1100 non-null   float64
 2   ph           1100 non-null   float64
 3   rainfall     1100 non-null   float64
 4   label        1100 non-null   object
dtypes: float64(4), object(1)
memory usage: 51.6+ KB

In [ ]:
new_crop['label'].nunique()

11

In [ ]:
new_fert.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11 entries, 0 to 75
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Crop    11 non-null     object
 1   N       11 non-null     object
 2   P       11 non-null     object
 3   K       11 non-null     object
 4   pH      11 non-null     float64
dtypes: float64(1), object(4)
memory usage: 528.0+ bytes